<?php
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'الفواتير',
            'قائمة الفواتير',
            'الفواتير المدفوعة',
            'الفواتير الغير مدفوعة',
            'الفواتير المدفوعة جزئيا',
            'الفواتير المؤرشفة',
            'التقارير',
            'تقرير الفواتير',
            'تقرير العملاء',
            'المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',
            'الاعدادات',
            'الاقسام',
            'المنتجات',


            'اضافة فاتورة',
            'تصدير EXCEL',
            'حذف الفاتورة',
            'تغير حالة الدفع',
            'تعديل الفاتورة',
            'ارشفة الفاتورة',
            'طباعةالفاتورة',
            'استعادة الفاتورة',
            'حذف فاتورة مؤرشفة',
            'اضافة مرفق',
            'عرض مرفق',
            'تحميل مرفق',
            'حذف مرفق',
            'عرض تفاصيل فاتورة',

            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',
            'عرض معلومات مستخدم',

            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',

            'اضافة قسم',
            'تعديل قسم',
            'حذف قسم',

            'الاشعارات',
        ];

        foreach ($permissions as $permission) {

            Permission::create(['name' => $permission]);
        }
    }
}
